{
  "splash.text": "Hi, my name is John. I’m a web developer",
  "text.cursor": "▌",
  "main.title": "Main Menu",
  "main.about": "About",
  "main.skills": "Skills",
  "main.projects": "Projects",
  "main.experience": "Experience",
  "main.contact": "Contact",
  "about.paragraph1": "Hello! I’m a developer and graphical user interface and visual design enthusiast. I love using and creating software. Now I’m hooked on developing for the most important software on our machines: the Internet browser.",
  "about.paragraph2": "I owe my life to the Internet. Without its existence, I never would have studied and lived outside of China, learned to speak English, became a US citizen, studied in various schools and universities, found my wife, and learned to code. I may not always dedicate myself to creating software for the web, but for now, I am truly fortunate to have this realm as my career and playground.",
  "about.paragraph3": "Oh and here’s a map of my whereabouts. I just need an excuse to put a map here because it looks cool.",
  "skills.column1": "Programming Languages",
  "skills.column2": "Libraries & Frameworks",
  "skills.paragraph": "Here are the things that I am actively using or have used recently. Obviously, the bars are just how I feel about my proficiency on each skill, and not my actual “experience level”. Therefore, some bars will grow in the future, while others might actually shrink as I will inevitably find out just how little I know.",
  "projects.message": "For now, check out my",
  "experience.title": "Technologies",
  "contact.LinkedIn": "LinkedIn",
  "contact.GitHub": "GitHub",
  "contact.Blog": "Blog",
  "contact.Email": "Email",
  "info.title": "Behind the page",
  "info.logo.title": "Logo",
  "info.logo.subtitle": "My Name",
  "info.logo.subtitle.p1": "It’s related to my name. Not “John”, my Chinese given name 远骋 (pinyin: yuǎn chěng), which literally means, per character, “far away” and “gallop”. I was born and raised in mainland China, and I was given this name because my father aimed to bring his career and our family’s lives outside of China, mainly to the US.",
  "info.logo.subtitle.p2": "In addition, Chinese culture has an obsession with zodiac signs. Mine happens to be horse (birth year: 1990). My parents cleverly chose the somewhat sophisticated and highly obscure character 骋 as part of my name to both contain the character for horse (马) and contribute to the meaning. This lead to teachers frequently mispronouncing my name, both Chinese and American alike. To make matters worse, the English phonetic for (远) “yuan” looks suspiciously like the common Spanish name Juan, leading to people calling me “Juan-cheng” (I don’t blame them, what kind of word has “y”, “u”, and “a”, what are practically all vowels, consecutively‽). Not to mention the omission of Chinese tones. Consequentially, I did not like my name.",
  "info.logo.subtitle2": "Reconciliation",
  "info.logo.subtitle2.p1": "As I began to brainstorm the logo design, I realized that my name parallels well with my current attitude towards my path to be a worthy developer/programmer. A full gallop, to a knowledge and skill ceiling far away... A horse in motion seemed fitting. What about the brackets? They are a prominent part of C based code syntax. Plus, I dunno, I thought they looked stylish.",
  "info.style.title": "Style",
  "info.style.subtitle": "Inspiration",
  "info.style.subtitle.p1": "My love of graphical user interfaces (GUI) started in video games. Growing up, I was the weird kid who liked to explore the menus, tweak the options, instead of just starting the game. Video game menus are frequently overlooked pieces of great UX/UI engineering. This site design is heavily based on one of my childhood favorite games with a fantastic UI: {link}.",
  "info.style.subtitle2": "Prototyping",
  "info.style.subtitle2.p1": "I made Sketch my tool of choice for high fidelity prototyping due to its growing popularity among UI designers. After learning a few concepts such as style guides, the 8 point grid, and theming, I have a work-in-progress prototype on my {link}.",
  "info.code.title": "Code",
  "info.code.subtitle": "Philosophy",
  "info.code.subtitle.p1": "I want to practice writing {clean} and {DRY} code. Unfortunately, this code base is an example of neither. I will improve! Also, I want to have minimum dependencies. Using Create React App for React is already dependency heavy, so I try to keep the list from growing longer. Lastly, I’m a sucker for new technologies and methodologies. I like to explore experimental features and APIs. It can be challenging due to fewer online discussions, but I like challenges!",
  "info.code.subtitle2": "React",
  "info.code.subtitle2.p1": "Besides the need for a personal website, this is an excuse to practice building web apps with React. While learning React from the official documentation, I learned about {Hooks}. Although the concept isn’t heavily required for a static website, I enjoyed the new perspective on components during development after having just learned lifecycle methods. However, I have yet to create a successful version of my Typer component (for animating typing) with Hooks! I won’t give up!",
  "info.code.subtitle2.p2": "To see what I’m talking about, or if you just want to see the code, checkout my {repo} on GitHub!",
  "info.credits.title": "Credits",
  "info.credits.subtitle": "Translation & Localization",
  "info.credits.subtitle.p1": "Chinese/Korean: Minjee Kim\nContact: {email} | {LinkedIn}",
  "nav.about": "About",
  "nav.skills": "Skills",
  "nav.projects": "Projects",
  "nav.experience": "Experience",
  "nav.contact": "Contact",
  "alert.projects": "I’m working on it!",
  "alert.404": "Invalid route. Redirecting in",
  "description.default": "Select an item to show more information",
  "description.main": "Select an item to continue",
  "description.main.info": "What's with the horse?",
  "description.main.about": "More about me",
  "description.main.skills": "My technical skills",
  "description.main.projects": "Past and ongoing projects",
  "description.main.experience": "Professional experience so far",
  "description.main.contact": "Get in touch!",
  "description.about.article": "Yes, writing about myself feels weird",
  "description.about.map": "No, it’s not actually centered on my house. However, I do live in Dublin, CA!",
  "description.skills.JavaScript": "Used on a daily basis both for work and personal projects. This language truly feels alive, and I can’t get enough",
  "description.skills.HTML5": "Used on a daily basis both for work and personal projects. I aim to write semantic HTML and be conscious about accessibility",
  "description.skills.CSS3": "Used on a daily basis both for work and personal projects. It really is the adjectives for the web. It’s behaviors made me mutter some colorful adjectives as well",
  "description.skills.Python": "My first programming language and my goto language for solving coding challenges. I used this to build a desktop GUI during my internship at Intel",
  "description.skills.Java": "My second programming language. I don’t have any work experience with this, only small projects I developed in college",
  "description.skills.SQL": "Learned this at work, but did not use extensively. I will keep this in my scope as I aim to become full-stack",
  "description.skills.React": "Used on a daily basis both for work and personal projects. This site is built with React. As my first real web app, React really is very entry level friendly while still offering advanced capabilities",
  "description.skills.Redux": "Used on a daily basis for work on a newer but existing code base. I understand its philosophies and how it interfaces with React on apps with complex state management",
  "description.skills.Angular": "Used for a previous work project. I learned more recent Angular framework versions while using AngularJS for work. I don’t have the proficiency to build my own project with this",
  "description.skills.MongoDB": "Self-taught and used in course projects. I learned relational databases before Mongo, and its non-relational paradigm felt refreshing. This will be my database of choice for my personal projects in the future",
  "description.skills.Express": "Self-taught and used in course projects. I only have a shallow concept of its capabilities. However, I plan to learn and use it more for both its simplicity and popularity",
  "description.skills.NodeJS": "I have a basic understanding of what role Node plays, why it’s made, and the changes it brought to web and application development. I frequently use NPM and develop with tools that run in Node",
  "description.projects.default": "This site is my current active front-end project!",
  "description.experience.default": "Select an icon to learn more about my role there",
  "description.experience.Intel": "Intern | June - December 2016\nDeveloped a desktop application using GUI library wxPython, a Python port of the C++ equivalent: wxWidgets",
  "description.experience.Infosys": "Associate | July 2017 - Present\nWorked with AngularJS and currently working on a React and Redux project with a Java server back-end",
  "description.contact.default": "Reach me!",
  "description.contact.LinkedIn": "Let's connect!",
  "description.contact.GitHub": "Checkout my work (not much right now) and collaborate",
  "description.contact.Blog": "When I want to write stuff other than code",
  "description.contact.Mail": "Please don't make it look like spam",
  "description.404": "ERROR"
}
