{
  "splash.text": "안녕하세요, 제 이름은 존입니다. 저는 웹 개발자입니다",
  "text.cursor": "▌",
  "main.title": "메인 메뉴",
  "main.about": "정보",
  "main.skills": "기술",
  "main.projects": "프로젝트",
  "main.experience": "경험",
  "main.contact": "연락",
  "about.paragraph1": "안녕하세요! 저는 개발자이자 그래픽 사용자 인터페이스와 시각 디자인 애호가입니다. 저는 소프트웨어를 사용하고 만드는 것을 좋아합니다. 현재는 컴퓨터에서 가장 중요한 소프트웨어인 인터넷 브라우저 개발에 푹 빠져 있습니다.",
  "about.paragraph2": "제 인생은 인터넷 덕을 많이 보았습니다. 인터넷이 없었다면 저는 결코 중국이 아닌 다른 나라에서 공부하고 살지 못했을 것이고, 영어를 배우지도, 다양한 친구를 사귀지도, 미국 시민이 되고, 여러 학교와 대학에서 공부하고, 아내를 만나고, 코딩을 배웠을 것입니다. 나는 항상 웹용 소프트웨어를 만드는 데 헌신하지 않을 수도 있지만 지금은 이 영역을 내 경력과 놀이터로 갖게 되어 정말 행운입니다.",
  "about.paragraph3": "아 그리고 여기 내 위치의 지도가 있습니다. 멋있어 보여서 여기에 지도를 넣을 핑계가 필요할 뿐입니다.",
  "skills.column1": "언어",
  "skills.column2": "라이브러리 및 프레임워크",
  "skills.paragraph": "다음은 내가 적극적으로 사용하거나 최근에 사용했던 것입니다. 분명히 막대는 내 실제 \"경험 수준\"이 아니라 각 기술에 대한 내 숙련도에 대한 느낌입니다. 따라서 일부 막대는 미래에 성장할 것이고 다른 막대는 내가 얼마나 아는 것이 적은지 필연적으로 알게 될 것이기 때문에 실제로 축소될 수 있습니다.",
  "projects.message": "지금은 내 것을 확인하십시오.",
  "experience.title": "기술",
  "contact.LinkedIn": "링크드인",
  "contact.GitHub": "GitHub",
  "contact.Blog": "블로그",
  "contact.Email": "이메일",
  "contact.Resume": "이력서",
  "info.title": "페이지 뒤",
  "info.logo.title": "심벌 마크",
  "info.logo.subtitle": "내 이름",
  "info.logo.subtitle.p1": "내 이름과 관련이 있습니다. \"John\"이 아니라 내 중국어 이름 远骋(병음: yuǎn chěng)은 글자 그대로 \"멀리\"와 \"달리다\"를 의미합니다. 나는 중국 본토에서 태어나고 자랐으며, 아버지가 자신의 경력과 가족의 삶을 중국 외부, 주로 미국으로 가져오는 것을 목표로 했기 때문에 이 이름을 갖게 되었습니다.",
  "info.logo.subtitle.p2": "또한 중국 문화에는 조디악 표지판에 대한 집착이 있습니다. 내 것은 우연히 말(출생년: 1990년)입니다. 부모님은 말(马)자를 포함하고 의미를 부여하기 위해 제 이름의 일부로 다소 세련되고 매우 모호한 骋자를 교묘하게 선택했습니다. 이로 인해 교사는 중국인과 미국인 모두 내 이름을 자주 잘못 발음하게 됩니다. 설상가상으로 (远) \"위안\"의 영어 발음은 스페인의 일반적인 이름인 Juan과 이상하게 비슷해 사람들이 저를 \"Juan-cheng\"이라고 부릅니다. , \"u\" 및 \"a\", 실질적으로 모든 모음은 연속적으로‽). 중국어 톤의 생략은 말할 것도 없습니다. 결과적으로 나는 내 이름이 마음에 들지 않았습니다.",
  "info.logo.subtitle2": "화해",
  "info.logo.subtitle2.p1": "로고 디자인에 대한 브레인스토밍을 시작하면서 내 이름이 가치 있는 개발자/프로그래머가 되기 위한 내 길에 대한 현재의 태도와 잘 일치한다는 것을 깨달았습니다. 전속력으로 저 멀리 지식과 기술의 한계까지... 움직이는 말이 적합해 보였다. 괄호는 어떻습니까? C 기반 코드 구문의 중요한 부분입니다. 게다가, 나는 그들이 스타일리시해 보인다고 생각했다.",
  "info.style.title": "스타일",
  "info.style.subtitle": "영감",
  "info.style.subtitle.p1": "그래픽 사용자 인터페이스(GUI)에 대한 나의 사랑은 비디오 게임에서 시작되었습니다. 자라면서 나는 게임을 시작하는 대신 메뉴를 탐색하고 옵션을 조정하는 것을 좋아하는 이상한 아이였습니다. 비디오 게임 메뉴는 훌륭한 UX/UI 엔지니어링에서 자주 간과되는 부분입니다. 이 사이트 디자인은 환상적인 UI를 가진 어린 시절 좋아했던 게임 중 하나인 {link}를 기반으로 합니다.",
  "info.style.subtitle2": "프로토타이핑",
  "info.style.subtitle2.p1": "저는 UI 디자이너들 사이에서 인기가 높아짐에 따라 고충실도 프로토타이핑을 위한 도구로 Sketch를 선택했습니다. 스타일 가이드, 8포인트 그리드 및 테마와 같은 몇 가지 개념을 학습한 후 {link}에서 작업 중인 프로토타입을 갖게 되었습니다.",
  "info.code.title": "암호",
  "info.code.subtitle": "철학",
  "info.code.subtitle.p1": "{clean} 및 {DRY} 코드 작성을 연습하고 싶습니다. 불행하게도 이 코드 베이스는 둘 다의 예가 아닙니다. 개선하겠습니다! 또한 최소한의 의존성을 갖고 싶습니다. Create React App for React를 사용하는 것은 이미 종속성이 많기 때문에 목록이 더 이상 늘어나지 않도록 노력합니다. 마지막으로, 저는 새로운 기술과 방법론에 빠져 있습니다. 실험적인 기능과 API를 탐색하는 것을 좋아합니다. 온라인 토론이 적기 때문에 어려울 수 있지만 저는 도전을 좋아합니다!",
  "info.code.subtitle2": "반응하다",
  "info.code.subtitle2.p1": "개인 웹사이트가 필요하다는 것 외에도 이것은 React로 웹 앱 구축을 연습하는 변명입니다. 공식 문서에서 React를 배우면서 {Hooks}에 대해 알게 되었습니다. 이 개념은 정적 웹 사이트에 크게 필요하지 않지만 수명 주기 메서드를 배운 후 개발 과정에서 구성 요소에 대한 새로운 관점을 즐겼습니다. 그러나 Hooks를 사용하여 Typer 구성 요소(타이핑 애니메이션용)의 성공적인 버전을 아직 만들지 못했습니다! 나는 포기하지 않을 것이다!",
  "info.code.subtitle2.p2": "내가 말하는 내용을 보거나 코드만 보고 싶다면 GitHub에서 내 {repo}를 확인하세요!",
  "info.credits.title": "학점",
  "info.credits.subtitle": "번역 및 현지화",
  "info.credits.subtitle.p1": "중국어/한국어: 김민지 연락처: {email} | {링크드인}",
  "nav.about": "에 대한",
  "nav.skills": "기술",
  "nav.projects": "프로젝트",
  "nav.experience": "경험",
  "nav.contact": "연락하다",
  "alert.projects": "작업 중입니다!",
  "alert.404": "경로가 잘못되었습니다. 리디렉션 중",
  "description.default": "자세한 정보를 보려면 항목을 선택하세요.",
  "description.main": "계속하려면 항목을 선택하세요.",
  "description.main.info": "말은 어때?",
  "description.main.about": "나에 대해 더 알아보기",
  "description.main.skills": "나의 기술력",
  "description.main.projects": "과거 및 진행 중인 프로젝트",
  "description.main.experience": "지금까지의 전문적인 경험",
  "description.main.contact": "연락하세요!",
  "description.about.article": "네, 제 자신에 대해 쓰는 게 이상해요",
  "description.about.map": "아니요, 사실 저희 집 중심이 아닙니다. 그러나 저는 캘리포니아 더블린에 살고 있습니다!",
  "description.skills.TypeScript": "업무 및 개인 프로젝트 모두에 매일 사용됩니다. 이 언어는 진정으로 살아있음을 느끼고 만족할 수 없습니다.",
  "description.skills.HTML": "업무 및 개인 프로젝트 모두에 매일 사용됩니다. 시맨틱 HTML을 작성하고 접근성을 의식하는 것을 목표로 합니다.",
  "description.skills.CSS": "업무 및 개인 프로젝트 모두에 매일 사용됩니다. 정말 웹의 형용사입니다. 그것의 행동은 나로 하여금 화려한 형용사를 중얼거리게 만들었다.",
  "description.skills.Python": "나의 첫 프로그래밍 언어. Intel에서 인턴십을 하는 동안 데스크탑 GUI를 구축하기 위해 이것을 사용했습니다.",
  "description.skills.Java": "나의 두 번째 프로그래밍 언어. Workday에서 GWT 코드베이스를 관리할 때 적당히 사용했습니다.",
  "description.skills.React": "업무 및 개인 프로젝트 모두에 매일 사용됩니다. 이 사이트는 React로 제작되었습니다. 내 첫 번째 실제 웹 앱인 React는 여전히 고급 기능을 제공하면서도 매우 입문자용 수준입니다.",
  "description.skills.Redux": "프로젝트 아키텍처를 설계하고 개발하는 작업에 매일 사용합니다. 독단적인 맛이 마음에 듭니다. Redux ToolKit은 다양한 기술 수준의 개발 팀과 함께 작업할 때 많은 모범 사례가 내장되어 있고 보다 동질적인 코딩 스타일을 적용합니다.",
  "description.skills.ReactSpring": "현재 React 앱을 애니메이션화하는 가장 좋아하는 방법입니다. 때때로 CSS 애니메이션은 JavaScript를 통해 달성할 수 있는 복잡한 상태 전환을 표현하기에 충분하지 않습니다. React-Spring이 부족한 부분을 채웁니다.",
  "description.skills.Storybook": "더 작은 구성 요소에서 더 큰 기능에 이르기까지 Storybook을 사용하여 내가 만든 것을 테스트, 문서화 및 시연합니다. 특히 기능, 접근성 및 국제화를 보여주기 위해",
  "description.skills.GWT": "직장에서 Java 사용에 대한 나의 주요 노출. GWT를 사용하면 Java로 웹 앱을 개발할 수 있으며 팬이라고 말할 수 없습니다.",
  "description.projects.default": "이 사이트는 현재 내 활성 프런트 엔드 프로젝트입니다!",
  "description.experience.default": "내 역할에 대해 자세히 알아보려면 아이콘을 선택하세요.",
  "description.experience.Intel": "인턴 | 2016년 6월 - 12월 GUI 라이브러리 wxPython을 사용하여 데스크탑 애플리케이션 개발, C++에 상응하는 Python 포트: wxWidgets",
  "description.experience.Infosys": "씨. 준회원 SDE | 2017년 7월 - 2019년 6월 AngularJS로 작업했으며 현재 Java 서버 백엔드로 React 및 Redux 프로젝트 작업 중",
  "description.experience.Workday": "소프트웨어 개발 엔지니어 III | 2019년 6월 - 현재 웹 접근성(a11y) 팀에서 작업하고 최신 테스트 및 국제화(i18n) 방법을 사용하면서 먼저 a11y로 React 앱 구축",
  "description.contact.default": "연락해!",
  "description.contact.LinkedIn": "연결하자!",
  "description.contact.GitHub": "내 작업을 확인하고(지금은 많지 않음) 공동 작업",
  "description.contact.Blog": "코드 이외의 것을 작성하고 싶을 때",
  "description.contact.Mail": "스팸처럼 만들지 말아주세요",
  "description.contact.Resume": "내 이력서의 인쇄용 PDF 받기",
  "description.404": "오류"
}
